[
    {
        "title": "Germany's Merz wants European nuclear weapons to boost U.S. shield",
        "description": "Germany, due to its Second World War past, has bound itself to non-nuclear defense in a number of international treaties but participates in NATO weapons-sharing arrangements.",
        "url": "https://www.japantimes.co.jp/news/2025/03/09/world/merz-wants-european-nuclear-weapons/",
        "count": 1
    },
    {
        "title": "Rubio heads to Saudi Arabia for US-Ukraine talks, then Canada for G7",
        "description": "State Department — U.S. Secretary of State Marco Rubio will arrive in Jeddah, Saudi Arabia, on Monday for U.S.-Ukraine talks as President Donald Trump pushes to broker a swift end to the Russia-Ukraine war.\n\n\nWhile in Jeddah, Rubio will also meet with Saudi C…",
        "url": "https://www.voanews.com/a/8004187.html",
        "count": 1
    },
    {
        "title": "'Axis of Evil' Sending Naval Forces to Gulf Amid Ukraine Peace Talks",
        "description": "The naval drills, which include \"striking maritime targets,\" will \"strengthen military mutual trust\" between Beijing, Moscow and Tehran, China said.",
        "url": "https://www.newsweek.com/russia-iran-china-naval-drills-gulf-oman-ukraine-ceasefire-talks-saudi-arabia-2041824",
        "count": 1
    },
    {
        "title": "Ukraine Planning New Strike on Crimean Bridge: Admiral",
        "description": "\"The Russians understand we are actively discussing a third operation. There is a saying: 'God loves a trinity,'\" said navy chief Oleksiy Neizhpapa.",
        "url": "https://www.newsweek.com/ukraine-planning-new-strike-crimean-bridge-admiral-2041822",
        "count": 1
    },
    {
        "title": "Russian forces walked inside gas pipeline to strike Ukrainian troops from rear in Kursk",
        "description": "Russian special forces used a gas pipeline to attack Ukrainian units in the Kursk region. Ukraine had taken territory in an earlier offensive but is now facing counterattacks from Russian and North Korean troops. Ukraine responded with rockets and artillery. …",
        "url": "https://economictimes.indiatimes.com/news/defence/russian-forces-walked-inside-gas-pipeline-to-strike-ukrainian-troops-from-rear-in-kursk/articleshow/118819729.cms",
        "count": 1
    },
    {
        "title": "Michigan State vs. Michigan prediction: College basketball picks, odds, best bets",
        "description": "Sunday’s rivalry game in East Lansing features two college basketball teams headed in very different directions.",
        "url": "https://nypost.com/2025/03/09/betting/michigan-state-vs-michigan-prediction-college-basketball-picks-odds-best-bets/",
        "count": 1
    },
    {
        "title": "Evaluating the Jaguars defense: Will they look to add in free agency?",
        "description": "NFL free agency officially begins on March 12 when the new league year opens. Will the Jaguars be active?",
        "url": "https://www.espn.com/nfl/story/_/id/44141305/will-jaguars-address-defense-2025-nfl-free-agency",
        "count": 1
    },
    {
        "title": "Trump's transactional approach to diplomacy is a driving force on the world stage",
        "description": "Donald Trump's approach to diplomacy mirrors his business style, emphasizing leverage and financial gains. His decisions, such as prioritizing Saudi Arabia for its economic investment and adopting a transactional stance with Ukraine while easing tensions with…",
        "url": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-transactional-approach-to-diplomacy-is-a-driving-force-on-the-world-stage/articleshow/118819500.cms",
        "count": 2
    },
    {
        "title": "Ukraine War Takes Fatal Turn, ATACMS, Storm Shadows and Oreshniks, Troop Losses and Desertions, NATO/EU Cracks",
        "description": "This incisive analysis by Rodney Atkinson first published in the immediate wake of the US presidential election, on November 25, 2024 documents troop losses and desertions by Ukrainian soldiers. It’s also focusses on the role of Russia’s advanced air …\nThe po…",
        "url": "https://www.globalresearch.ca/ukraine-war-takes-fatal-turn/5873634",
        "count": 1
    },
    {
        "title": "U.N. Security Council Meeting on “Threats to International Peace”: The Ukraine War Could have Been Avoided. Address by George Szamuely",
        "description": "First published on November 5, 2024\nThank you, Madam President, and thank you for giving me this opportunity to address this distinguished body.\nIf ever a war could easily have been avoided, the war in Ukraine is that war. If …\nThe post U.N. Security Council …",
        "url": "https://www.globalresearch.ca/address-un-security-council-oct-2024-george-szamuely/5871930",
        "count": 1
    },
    {
        "title": "Trump wants to see more than just a minerals deal to restart aid and intel to Ukraine",
        "description": "As U.S. and Ukrainian officials prepare to meet in Saudi Arabia this week, President Donald Trump has privately made clear to aides that a signed minerals deal between Washington and Kyiv won’t be enough to restart aid and intelligence sharing with the war-to…",
        "url": "https://www.nbcnews.com/politics/national-security/trump-wants-see-just-minerals-deal-restart-aid-intel-ukraine-rcna195508",
        "count": 1
    },
    {
        "title": "Links 3/9/2025",
        "description": "Links from the NC Internet panopticon: the magnificent calculator, mystery disease, vanishing sea ice, cheating AIs, Kung Fu robot, Mideast mayhem, Climbing Big Ben, and more",
        "url": "https://www.nakedcapitalism.com/2025/03/links-3-9-2025.html",
        "count": 1
    },
    {
        "title": "Turkish FM to attend regional security meeting in Jordan",
        "description": "Turkish Foreign Minister Hakan Fidan is set to attend a key regional security meeting in the Jordanian capital Amman on March 9, according to Turkish diplomatic sources.",
        "url": "https://www.hurriyetdailynews.com/turkish-fm-to-attend-regional-security-meeting-in-jordan-206679",
        "count": 1
    },
    {
        "title": "Almost Timely News: ️ Transformative Strategy with Generative AI (2025-03-09)",
        "description": "Almost Timely News: ️ Transformative Strategy with Generative AI (2025-03-09) :: View in Browser The Big Plug Please forward this newsletter to two people who need it. Or just send them to ChristopherSPenn.com/newsletter. Thanks! Content Authenticity Statem…",
        "url": "https://www.christopherspenn.com/2025/03/almost-timely-news-%f0%9f%97%9e%ef%b8%8f-transformative-strategy-with-generative-ai-2025-03-09/",
        "count": 1
    },
    {
        "title": "EU's aggressive environmental regulations biggest hurdles of FTA talks with India: GTRI",
        "description": "EU's aggressive environmental regulations biggest hurdles of FTA talks with India: GTRI",
        "url": "https://www.livemint.com/companies/news/eus-aggressive-environmental-regulations-biggest-hurdles-of-fta-talks-with-india-gtri-11741512026855.html",
        "count": 1
    },
    {
        "title": "Macron's diplomatic comeback: from France's domestic crisis to reshaping Europe's defense",
        "description": "French President Emmanuel Macron is back at the center of global diplomacy",
        "url": "https://abcnews.go.com/International/wireStory/macrons-diplomatic-comeback-frances-domestic-crisis-reshaping-europes-119602645",
        "count": 1
    },
    {
        "title": "Ukraine’s losses mounting due to US intel freeze – Time",
        "description": "The lack of US intel has crippled Ukraine’s ability to fight Russia and anticipate strikes, Time has reported Read Full Article at RT.com",
        "url": "https://www.rt.com/russia/613927-ukraine-losses-us-intel-freeze/",
        "count": 1
    },
    {
        "title": "Trump brings sanity to Russia and Ukraine",
        "description": "The recent geopolitical chess match between President Trump and Vladimir Putin has shattered the old narratives surrounding the Ukraine conflict.  With a firm ultimatum, President Trump has made it clear that the war must end, putting direc...",
        "url": "https://www.americanthinker.com/blog/2025/03/trump_brings_sanity_to_russia_and_ukraine.html",
        "count": 1
    },
    {
        "title": "Iran's supreme leader rejects nuclear talks with US after Trump's overtures",
        "description": "Ayatollah Ali Khamenei, Iran's supreme leader, said in a series of X posts Saturday he would not negotiate a nuclear deal with the U.S. due to its demands.",
        "url": "https://www.foxnews.com/world/iran-supreme-leader-rejects-nuclear-talks-us-following-trump-overtures",
        "count": 1
    },
    {
        "title": "Peace, coexistence, and disillusionment: How do we move forward?",
        "description": "Our nation is hurting deeply. The road ahead is long, and we may never fully heal. But amid our collective trauma, one thing I know for certain is that our nation’s faith and spirit will prevail.",
        "url": "https://www.jpost.com/opinion/article-845211",
        "count": 1
    },
    {
        "title": "India says it is working to cut tariffs as it eyes US trade deal",
        "description": "India said Friday it is working to lower trade barriers with the United States as it tries to reach a bilateral trade deal with Washington this year.",
        "url": "https://www.globalsecurity.org/wmd/library/news/india/2025/india-250308-voa01.htm",
        "count": 2
    },
    {
        "title": "'Russia's Goals Unchanged' After Deadly Air Strikes On Ukraine, Says Zelenskyy",
        "description": "Ukrainian President Volodymyr Zelenskyy has said Russia's latest deadly air strikes show Moscow's war objectives remained \"unchanged\" and called for new sanctions.",
        "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/03/ukraine-250308-rferl02.htm",
        "count": 1
    },
    {
        "title": "Nyja Williams' defensive gem helps Principia reach final four for second successive season",
        "description": "Principia (25-5) advanced to the final four for the second year in a row after losing in the Class 2 title contest last season.",
        "url": "https://www.stltoday.com/sports/high-school/girls-basketball/article_249ae0ac-fc4d-11ef-bc56-e72c15557122.html",
        "count": 1
    },
    {
        "title": "Iran’s supreme leader rejects talks after Trump sends letter seeking new nuclear deal",
        "description": "Speaking to a group of officials on Saturday, Iran’s Supreme Leader Ayatollah Ali Khamenei said he rejects a push for talks by a “bullying government” because they would be aimed at imposing restrictions on Iranian missile range and its influence in the regio…",
        "url": "https://www.pbs.org/newshour/world/irans-supreme-leader-rejects-talks-after-trump-sends-letter-seeking-new-nuclear-deal",
        "count": 1
    },
    {
        "title": "AP News in Brief at 6:04 p.m. EST",
        "description": "US economic worries mount as Trump implements tariffs, cuts workforce and freezes spending",
        "url": "https://ca.news.yahoo.com/ap-news-brief-12-04-050527171.html",
        "count": 1
    },
    {
        "title": "Russia claims advances in Kursk; Zelenskyy says he's 'committed' to talks",
        "description": "KYIV, UKRAINE — Russia said Saturday its troops had retaken three villages seized by Ukraine in its Kursk border region, in a fresh setback for Kyiv ahead of talks to try to end the war. \n\n\nUkrainian President Volodymyr Zelenskyy on Saturday named a high-leve…",
        "url": "https://www.voanews.com/a/russia-claims-advances-in-kursk-as-zelenskyy-says-committed-to-talks-/8003845.html",
        "count": 1
    },
    {
        "title": "Iran will not negotiate under U.S. bullying, Supreme Leader says",
        "description": "Iran's Supreme Leader Ayatollah Ali Khamenei said on Saturday Iran will not be bullied into negotiations, a day after U.S. President Donald Trump said he had sent a letter to the country's top authority to negotiate a nuclear deal. In an interview with Fox Bu…",
        "url": "https://japantoday.com/category/world/iran-will-not-negotiate-under-us-%27bullying%27-supreme-leader-says",
        "count": 1
    },
    {
        "title": "Exposing Hypocrisy in the Health Freedom Movement",
        "description": "My guest on my series ‘Truth IS Truth’ is Christine Massey. She is a Canadian researcher, who has done amazing work with sending out hundreds of Freedom of Information Act (FOIA) requests to Health agencies and Health institutions all over the world.Her first…",
        "url": "https://www.awake2onenessradio.org/post/exposing-hypocrisy-in-the-health-freedom-movement",
        "count": 1
    },
    {
        "title": "Iran's Top Leader Rejects 'Bullying' Trump Call For New Nuclear Talks",
        "description": "\"Their talks are not aimed at solving problems,\" said Supreme Leader Ayatollah Ali Khamenei, without mentioning the United States by name.",
        "url": "https://www.huffpost.com/entry/irans-top-leader-rejects-bullying-trump-call-for-new-nuclear-talks_n_67cca47be4b07efb43a7d014",
        "count": 1
    },
    {
        "title": "Washington considering ‘rare earths’ deal with African state – FT",
        "description": "The Democratic Republic of Congo hopes to secure American military aid in exchange to thwart advances by militants Read Full Article at RT.com",
        "url": "https://www.rt.com/africa/613917-ft-us-drc-considering-minerals-deal/",
        "count": 1
    },
    {
        "title": "Heavy Russian strikes kill more than 20 people in Ukraine as U.S. withholds intelligence",
        "description": "When asked Friday if Russian President Vladimir Putin was taking advantage of the U.S. pause on intelligence-sharing to attack Ukraine, Trump responded: “I think he’s doing what anybody else would.”",
        "url": "https://www.pbs.org/newshour/world/heavy-russian-strikes-kill-more-than-20-people-in-ukraine-as-u-s-withholds-intelligence",
        "count": 1
    },
    {
        "title": "Iran's Supreme Leader Ayatollah Ali Khamenei rejects talks with the U.S.",
        "description": "Iran's Supreme Leader Ayatollah Ali Khamenei said talks between the two countries would be aimed at imposing restrictions on Iranian missile range and its influence in the region.",
        "url": "https://www.cbsnews.com/news/irans-top-leader-rejects-talks-with-the-u-s/",
        "count": 1
    },
    {
        "title": "Iran’s top leader rejects talks with US after Trump makes overture",
        "description": "TEHRAN, IRAN — Iranian Supreme Leader Ayatollah Ali Khamenei said he rejects a U.S. push for talks between the two countries because they would be aimed at imposing restrictions on Iranian missile range and its influence in the region.\n\n\nSpeaking to a group o…",
        "url": "https://www.voanews.com/a/iran-s-top-leader-rejects-talks-with-us-after-trump-makes-overture/8003752.html",
        "count": 1
    },
    {
        "title": "Elon Musk Is Leading a Far Right Anti-Empathy Revolution",
        "description": "Musk views empathy as a “bug” that threatens his political agenda. This framing is instructive.",
        "url": "https://organizingmythoughts.org/the-anti-empathy-revolution-of-elon-musk/",
        "count": 1
    },
    {
        "title": "Iran’s top leader rejects talks with the US over missile range, regional influence",
        "description": "Iran’s Supreme Leader Ayatollah Ali Khamenei says he rejects a U.S. push for talks between the two countries because they would be aimed at imposing restrictions on Iranian missile range and its regional influence",
        "url": "https://abcnews.go.com/International/wireStory/irans-top-leader-rejects-talks-us-missile-range-119591065",
        "count": 1
    },
    {
        "title": "Iran slams US as ‘bully’ after Trump’s letter warning against nuclear acquisition",
        "description": "\"The insistence of some bully governments on negotiations is not to resolve issues, but to dominate and impose their own expectations.\"",
        "url": "https://nypost.com/2025/03/08/us-news/iran-responds-one-day-after-trump-sends-nuclear-negotiation-letter/",
        "count": 1
    },
    {
        "title": "House Unveils Trump-Backed Bill to Avert US Government Shutdown",
        "description": "House Republicans announced a spending bill to keep government agencies open through Sept. 30, daring Democrats to vote against it and risk a disruptive March 15 shutdown.",
        "url": "https://financialpost.com/pmn/business-pmn/house-unveils-trump-backed-bill-to-avert-us-government-shutdown",
        "count": 1
    },
    {
        "title": "Ukraine War Map Shows Thousands of Kyiv's Troops at Risk of Encirclement",
        "description": "Kyiv's troops are struggling to hold territory in Russia's Kursk region and may be forced to retreat, reports say.",
        "url": "https://www.newsweek.com/russia-kursk-sumy-ukraine-troops-risk-encirclement-2041627",
        "count": 1
    },
    {
        "title": "Ukrainian lawmaker tells BI that Trump has taken away one of the 'most important things' Kyiv got from the US and left it at risk",
        "description": "The Trump administration this week paused military aid to Ukraine, as well as intelligence sharing and its access to satellite imagery.",
        "url": "https://www.businessinsider.com/cutting-satellite-imagery-weakens-ukraines-defenses-lawmaker-2025-3",
        "count": 1
    },
    {
        "title": "German Conservatives, Social Democrats Edge Closer to Coalition",
        "description": "Germany’s conservatives and the Social Democrats agreed to deepen talks over forming a new government, a step forward as pressure builds on Chancellor-in-waiting Friedrich Merz to implement sweeping reforms.",
        "url": "https://financialpost.com/pmn/business-pmn/german-conservatives-social-democrats-edge-closer-to-coalition",
        "count": 1
    },
    {
        "title": "Russian Strikes Have Surged Since Donald Trump's Return",
        "description": "The Institute for the Study of War has found that daily attacks on Ukraine by Russia have spiked over the past six weeks.",
        "url": "https://www.newsweek.com/russia-ukraine-strikes-trump-missile-2041606",
        "count": 1
    },
    {
        "title": "Trump says Ukraine 'more difficult' to deal with than Russia",
        "description": "It may be 'easier dealing with' Moscow than Kyiv, the US president told reporters in the White House.",
        "url": "https://www.bbc.com/news/articles/crknjxj3n4zo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
        "count": 2
    },
    {
        "title": "Trump Threatens Russia With Sanctions After Latest Massive Air Assault On Ukraine",
        "description": "Trump Threatens Russia With Sanctions After Latest Massive Air Assault On Ukraine",
        "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/03/ukraine-250307-rferl03.htm",
        "count": 1
    },
    {
        "title": "This Bitcoin Signal Aligns With Price Tops, CryptoQuant Analyst Reveals",
        "description": "The community analyst at the on-chain analytics firm CryptoQuant has pointed out how this Bitcoin indicator has been aligning with price tops. Bitcoin Binance Whale To Exchange Flow Shows An Interesting Pattern In a new post on X, CryptoQuant community analys…",
        "url": "http://www.newsbtc.com/bitcoin-news/bitcoin-aligns-price-tops-cryptoquant-analyst/",
        "count": 1
    },
    {
        "title": "India signs deal with Russia for T-72 tank engines",
        "description": "India has signed a $248 million contract with Rosoboronexport for T-72 tank engines, including technology transfer Read Full Article at RT.com",
        "url": "https://www.rt.com/india/613896-india-deal-t72-tank-engines/",
        "count": 1
    },
    {
        "title": "Russia Says Major Oil Refinery Near St. Petersburg Hit by Drone",
        "description": "Russia said a key oil refinery near St. Petersburg was hit by a drone, while Ukraine reported attacks in several regions, including Odesa on the Black Sea.",
        "url": "https://financialpost.com/pmn/business-pmn/russia-says-major-oil-refinery-near-st-petersburg-hit-by-drone",
        "count": 1
    },
    {
        "title": "Trump invites Iran leader to nuclear talks — or else",
        "description": "U.S. President Donald Trump said Friday that he has written to Iran's supreme leader pressing for new talks on its nuclear program, warning of possible military action if not.",
        "url": "https://www.hurriyetdailynews.com/trump-invites-iran-leader-to-nuclear-talks-or-else-206654",
        "count": 1
    },
    {
        "title": "Russian strikes kill 12 in eastern Ukraine",
        "description": "Russian strikes overnight had killed at least 12 people in eastern Ukraine as of Saturday morning, the country's emergency service said, days ahead of talks in Saudi Arabia between U.S. and Ukrainian negotiators aimed at a truce.",
        "url": "https://www.hurriyetdailynews.com/russian-strikes-kill-12-in-eastern-ukraine-206653",
        "count": 1
    },
    {
        "title": "Starmer Puts Hard Power Over Soft Left in UK Changed by Trump",
        "description": "Keir Starmer’s allies argue the crisis into which President Donald Trump has plunged Europe can be the making of the British prime minister. They also say what comes next could just as easily break him.",
        "url": "https://financialpost.com/pmn/business-pmn/starmer-puts-hard-power-over-soft-left-in-uk-changed-by-trump",
        "count": 1
    },
    {
        "title": "Ukraine Prepares For US Talks In Saudi Arabia After Europe Rallies Around Zelenskyy",
        "description": "After a successful summit in Brussels that saw Ukrainian President Volodymyr Zelenskyy receive strong backing from European leaders, Kyiv will now turn its attention to high-stakes talks next week between Ukrainian and US officials.",
        "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/03/ukraine-250307-rferl02.htm",
        "count": 1
    },
    {
        "title": "Analysis: Ukraine Forced To Saudi Talks With Fewer Cards Than Ever",
        "description": "Ukraine is a recalcitrant mule that's been smashed on the nose with a plank of wood.",
        "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/03/ukraine-250308-rferl01.htm",
        "count": 1
    },
    {
        "title": "Russia Says It's Open To Broad Nuclear Talks With Trump",
        "description": "Amid the frantic pace of ongoing diplomatic outreach between Russia and the United States over ending the war in Ukraine, the two powers also have arms control high on their agendas.",
        "url": "https://www.globalsecurity.org/wmd/library/news/russia/2025/03/russia-250307-rferl01.htm",
        "count": 1
    },
    {
        "title": "EU leaders agree to dramatically increase military spending amid rift with US",
        "description": "European leaders have agreed to dramatically increase military spending, and continue to support Ukraine against Russia, after US President Donald Trump halted the military and intelligence aid to Kiev.",
        "url": "https://www.globalsecurity.org/military/library/news/2025/03/mil-250307-presstv09.htm",
        "count": 1
    },
    {
        "title": "Trump sends letter to Iran, pressing for restart of nuclear talks",
        "description": "U.S. President Donald Trump on Friday appeared to signal that he is ready to take military action on Iran, unless the country agrees to a new deal that would restrain its rapidly advancing nuclear program.",
        "url": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250307-voa01.htm",
        "count": 2
    },
    {
        "title": "Trump disables U.S. missile systems in Ukraine, forces Zelensky to face reality of peace talks",
        "description": "• President Donald Trump orders shutdown of U.S. missile systems in Ukraine, limiting Kyiv’s ability to strike Russian targets. • Trump administration halts military aid and intelligence-sharing with Ukraine, pushing for peace negotiations with Russia. • Zele…",
        "url": "https://www.naturalnews.com/2025-03-08-trump-disables-us-missile-systems-in-ukraine.html",
        "count": 1
    },
    {
        "title": "Senate Republicans pass budget resolution for Trump’s border security initiatives despite Democratic opposition",
        "description": "Senate Republicans blocked Democratic amendments to a budget resolution that would allocate over $340 billion for President Donald Trump’s border security initiatives, after a lengthy debate and a 52-48 vote. Democrats argued that the 2017 GOP tax cuts dispro…",
        "url": "https://www.naturalnews.com/2025-03-08-senate-republicans-pass-budget-resolution-border-security.html",
        "count": 1
    },
    {
        "title": "US mulls how to ease Russia energy sanctions quickly if war ends, sources say",
        "description": "The White House has asked the Treasury Department to explore options for easing energy sanctions ahead of expected talks between President Donald Trump and Russian President Vladimir Putin to end the Ukraine war",
        "url": "https://www.thehindubusinessline.com/news/world/us-mulls-how-to-ease-russia-energy-sanctions-quickly-if-war-ends-sources-say/article69305731.ece",
        "count": 1
    },
    {
        "title": "Republicans try to go it alone on government funding as shutdown deadline nears",
        "description": "House Republicans are looking to what for them is almost unheard of —- approving government funding on their terms with little help from Democrats",
        "url": "https://abcnews.go.com/US/wireStory/republicans-government-funding-shutdown-deadline-nears-119581483",
        "count": 1
    },
    {
        "title": "Chris Drury wanted to show Rangers he believes in playoff ‘push’ with measured trade deadline",
        "description": "Chris Drury said he wanted to thread the needle for the Rangers ahead of Friday’s 3 p.m. trade deadline.",
        "url": "https://nypost.com/2025/03/07/sports/chris-drury-wanted-to-show-rangers-he-believes-in-playoff-push/",
        "count": 1
    },
    {
        "title": "Elon Musk’s Starlink has a growing footprint in the federal government",
        "description": "The use of Starlink has been adopted by at least one additional federal agency since Donald Trump began his second presidential term.",
        "url": "https://www.nbcnews.com/tech/elon-musk/elon-musk-starlink-growing-footprint-federal-government-rcna195400",
        "count": 1
    },
    {
        "title": "A lion in winter vs. the rabbit chaser: As Tom Izzo reinforces his greatness at 70, new rival Dusty May hunts",
        "description": "Michigan State is again king of the Big Ten. Can Dusty May one day do for Michigan what Tom Izzo has for MSU? An under-appreciated rivalry gets a compelling reboot",
        "url": "https://www.cbssports.com/college-basketball/news/a-lion-in-winter-vs-the-rabbit-chaser-as-tom-izzo-reinforces-his-greatness-at-70-new-rival-dusty-may-hunts/",
        "count": 1
    },
    {
        "title": "‘The Traitors’ Winners Discuss the Shocking Season 3 Finale",
        "description": "Dylan Efron, Gabby Windey, Lord Ivar Mountbatten, and Dolores Catania on being the show's first winners who aren't alums of a reality competition",
        "url": "http://www.rollingstone.com/tv-movies/tv-movie-features/traitors-season-3-winners-interview-1235292081/",
        "count": 1
    },
    {
        "title": "Trump invites Iran leader to nuclear talks -- or else",
        "description": "Washington (AFP) Mar 7, 2025\n\n\n US President Donald Trump said Friday that he has written to Iran's supreme leader pressing for new talks on its nuclear program, warning of possible military action if not. \n\nIran's foreign minister told AFP on Friday that his…",
        "url": "https://www.spacewar.com/reports/Trump_invites_Iran_leader_to_nuclear_talks_or_else_999.html",
        "count": 1
    },
    {
        "title": "No talks with US under 'maximum pressure' policy, Iran FM tells AFP",
        "description": "Jeddah, Saudi Arabia (AFP) Mar 7, 2025\n\n\n Iran will not resume negotiations with the United States on its nuclear programme while President Donald Trump applies his \"maximum pressure\" policy, Foreign Minister Abbas Araghchi told AFP on Friday. \n\nIran will mai…",
        "url": "https://www.spacewar.com/reports/No_talks_with_US_under_maximum_pressure_policy_Iran_FM_tells_AFP_999.html",
        "count": 1
    },
    {
        "title": "Zelensky again urges air truce after 'massive' Russian attack",
        "description": "Kyiv, Ukraine (AFP) Mar 7, 2025\n\n\n Russia launched a \"massive\" drone and missile attack on Ukrainian energy facilities Friday, as President Volodymyr Zelensky renewed calls for a mutual halt to aerial attacks on critical infrastructure. \n\nThe call from Zelens…",
        "url": "https://www.spacewar.com/reports/Zelensky_again_urges_air_truce_after_massive_Russian_attack_999.html",
        "count": 1
    },
    {
        "title": "Faced with Russia, EU's defence must include Turkey",
        "description": "Istanbul (AFP) Mar 7, 2025\n\n\n Turkey, with NATO's second-largest army and a Black Sea coastline, is looking to play a key role in Europe's security after Washington's pivot away from the region. \n\nAfter two rounds of crisis talks on Ukraine and security follo…",
        "url": "https://www.spacewar.com/reports/Faced_with_Russia_EUs_defence_must_include_Turkey_999.html",
        "count": 1
    },
    {
        "title": "French defence minister to host key European counterparts on Ukraine",
        "description": "Paris (AFP) Mar 7, 2025\n\n France's defence minister is to hold talks next week with counterparts from Britain, Germany, Italy and Poland to discuss support for Ukraine, an aide said on Friday. \n\nThe ministers from Europe's five main military powers will meet …",
        "url": "https://www.spacewar.com/reports/French_defence_minister_to_host_key_European_counterparts_on_Ukraine_999.html",
        "count": 1
    },
    {
        "title": "Russia calls French nuclear comments a 'threat'; EU shifts on defence, 'Macron was right'",
        "description": "Moscow (AFP) Mar 6, 2025\n\n Russia views comments by President Emmanuel Macron about extending France's nuclear deterrent to other European countries as a \"threat\", Foreign Minister Sergei Lavrov said on Thursday. \n\nLavrov also reaffirmed his country's opposit…",
        "url": "https://www.spacewar.com/reports/Russia_calls_French_nuclear_comments_a_threat_999.html",
        "count": 1
    },
    {
        "title": "Trump Is Offering Putin Another Munich",
        "description": "Hitler didn’t want a peace deal, and neither does Putin.",
        "url": "https://www.theatlantic.com/international/archive/2025/03/putin-hitler-munich-parallel/681973/",
        "count": 1
    },
    {
        "title": "3 up, 3 down at Cardinals spring training and 1 lineup dilemma yet to come around: BPIB",
        "description": "Post-Dispatch sports writers Derrick Goold and Jeff Gordon detail a decision Cardinals must make between defense and offense",
        "url": "https://www.stltoday.com/sports/professional/mlb/cardinals/article_6bf5972c-fbb1-11ef-8eab-673b95e68146.html",
        "count": 1
    },
    {
        "title": "Can Europe save Ukraine?",
        "description": "It’s possible that three years of fighting between Russia and Ukraine could end — at least temporarily— in a matter of weeks. It’s more likely it could continue for months or even years.  US and allied intelligence agencies have concluded Russia is probably n…",
        "url": "https://www.vox.com/russia-ukraine/403127/europe-ukraine-aid-trump-zelenskyy",
        "count": 1
    },
    {
        "title": "Is Trump Borrowing Biden's 'Bear Hug' Approach to Israel?",
        "description": "The president is publicly taking a tough line on the Middle East—while privately supporting diplomacy.",
        "url": "https://reason.com/2025/03/07/is-trump-borrowing-bidens-bear-hug-approach-to-israel/",
        "count": 1
    },
    {
        "title": "USA Won't Hesitate on Russia and Iran Sanctions, Bessent Says",
        "description": "The U.S. will not hesitate to go 'all in' on sanctions on Russian energy if it helps lead to a ceasefire in the Ukraine war, Treasury Secretary Scott Bessent said Thursday.",
        "url": "https://www.rigzone.com/news/wire/usa_wont_hesitate_on_russia_and_iran_sanctions_bessent_says-07-mar-2025-179854-article/",
        "count": 1
    },
    {
        "title": "How Wagner Cut Its Teeth in Syria",
        "description": "Russian mercenaries weren’t always welcomed by the state, but their fighting on behalf of Bashar al-Assad was a prelude to Ukraine.",
        "url": "http://foreignpolicy.com/2025/03/07/syria-wagner-prigozhin-russia-mercenaries-death-business/",
        "count": 2
    },
    {
        "title": "Trump Invites Iran Leader To Nuclear Talks -- Or Else",
        "description": "US President Donald Trump said Friday that he has written to Iran's supreme leader pressing for new talks on its nuclear program, warning of possible military action if not.",
        "url": "https://www.ibtimes.com.au/trump-invites-iran-leader-nuclear-talks-else-1856712",
        "count": 1
    },
    {
        "title": "Friday, March 7. Russia’s War On Ukraine: News And Information From Ukraine",
        "description": "Dispatches from Ukraine. Day 1,103",
        "url": "https://www.forbes.com/sites/katyasoldak/2025/03/07/friday-march-7-russias-war-on-ukraine-news-and-information-from-ukraine/",
        "count": 1
    },
    {
        "title": "Keir Starmer welcomes EU moves to boost defence spending - BBC.com",
        "description": "Keir Starmer welcomes EU moves to boost defence spendingBBC.com EU leaders commit to working together after Trump signals that Europe must defend itselfThe Associated Press The EU backs a big defense package as Zelenskyy confirms talks with the U.S. next week…",
        "url": "https://slashdot.org/firehose.pl?op=view&amp;id=176645453",
        "count": 1
    },
    {
        "title": "PODCAST: Donald Trump’s Foreign Policy Shake-Up",
        "description": "President Donald Trump has thrown another curveball into global politics, seemingly reversing course on Ukraine negotiations and threatening new sanctions on Russia in a Truth Social post—just as he hints at potential diplomatic talks with Tehran. Donald Trum…",
        "url": "https://nationalinterest.org/blog/politics/podcast-donald-trumps-foreign-policy-shake-up/",
        "count": 1
    },
    {
        "title": "Hungarian PM Orbán Says Military Spending Frenzy and Decision To Support Kiev’s War Will ‘Ruin Europe’ – Budapest To Hold Consultation With Its Citizens Over Ukraine Joining the EU",
        "description": "Hungarian Prime Minister Viktor Orbán warns that escalating military expenditures and support for Ukraine could jeopardize Europe's stability, prompting a national consultation on the implications of Ukraine's EU membership.\nThe post Hungarian PM Orbán Says M…",
        "url": "https://www.thegatewaypundit.com/2025/03/hungarian-pm-orban-says-military-spending-frenzy-decision/",
        "count": 1
    },
    {
        "title": "We Need To Ban Idiots From Using Historical Analogies",
        "description": "Idiots like Russell Moore should abstain from using historical analogies in their pitiful attempts to influence the public discourse.",
        "url": "https://thefederalist.com/2025/03/07/we-need-to-ban-idiots-from-using-historical-analogies/",
        "count": 1
    },
    {
        "title": "“Hundreds of Dead”: Inside the Fallout from Trump’s Ukraine Intel Pause",
        "description": "The US intelligence pause has undercut supply lines to Kursk, cut satellite imagery and tanked morale.",
        "url": "https://time.com/7265679/satellites-front-failing-hundreds-dead-fallout-trump-ukraine-aid-pause/",
        "count": 1
    },
    {
        "title": "Russia bombards Ukraine’s energy grid after Zelenskyy announces talks next week with the U.S.",
        "description": "Officials say Russia targeted Ukraine's energy infrastructure in a large-scale missile and drone bombardment during the night.",
        "url": "https://www.pbs.org/newshour/world/russia-bombards-ukraines-energy-grid-after-zelenskyy-announces-talks-next-week-with-the-u-s",
        "count": 1
    },
    {
        "title": "Turkey’s Akıncı UCAV Flies with MURAD AESA Radar",
        "description": "Equipped with the new MURAD AESA radar, the Akıncı can track both aerial and ground targets, paving the way for a future in an air-to-air role with the integration of the indigenous Bozdoğan and Gökdoğan AAMs. Turkey’s Bayraktar Akıncı UCAV (Unmanned Combat A…",
        "url": "https://theaviationist.com/2025/03/07/turkeys-akinci-ucav-flies-with-murad-aesa-radar/",
        "count": 1
    },
    {
        "title": "Colombian FARC dissidents take 29 soldiers, police captive",
        "description": "Dissident members of Colombia’s FARC rebel group have taken 29 soldiers and police officers captive during clashes with the military in a key cocaine-growing region in the southwest, the defense ministry said Friday. The ministry blamed Thursday’s attack on m…",
        "url": "https://www.digitaljournal.com/world/colombian-farc-dissidents-take-29-soldiers-police-captive/article",
        "count": 1
    },
    {
        "title": "Russia targets Ukrainian energy assets in overnight aerial barrage",
        "description": "Russia has repeatedly targeted key energy assets inside Ukraine, with officials accusing the Kremlin of 'weaponising winter'.",
        "url": "https://www.abc.net.au/news/2025-03-08/russia-attacks-ukrainian-energy-facilities-in-missile-attacks/105026324",
        "count": 1
    },
    {
        "title": "Look: NASA Photos Capture Experimental Supersonic Aircraft as it Noiselessly Breaks the Sound Barrier",
        "description": "In a stunning series of images, NASA has revealed the moment an experimental supersonic aircraft broke the sound barrier without producing a sonic boom audible at ground level. The images were obtained using specialized photographic methods during flight test…",
        "url": "https://freerepublic.com/focus/f-chat/4302776/posts",
        "count": 1
    },
    {
        "title": "On Ukraine, Split the Difference Between Trump and Biden",
        "description": "One U.S. president deferred too much to Zelensky, while the other is trying to dictate terms.",
        "url": "http://foreignpolicy.com/2025/03/07/ukraine-split-difference-trump-biden-russia-war/",
        "count": 1
    },
    {
        "title": "Europe’s New Power Trio",
        "description": "Incoming German Chancellor Friedrich Merz is politically aligned with the European Union’s two most powerful politicians: Ursula von der Leyen and Manfred Weber. This trio of Christian Democrats could increase European defense spending – as illustrated by the…",
        "url": "https://www.project-syndicate.org/commentary/europe-power-trio-merz-von-der-leyen-weber-boost-defense-spending-by-simon-toubeau-2025-03",
        "count": 1
    },
    {
        "title": "Saudi Arabia Wins Over Trump With Trillion-Dollar Bid",
        "description": "Trump will make the kingdom a destination for his first international trip",
        "url": "https://www.newsweek.com/saudi-trump-trillion-dollars-investment-2041220",
        "count": 1
    },
    {
        "title": "US continues to share data to protect Ukrainians against Russian strikes, despite intel pause: sources",
        "description": "The U.S. is continuing to share information to help Ukraine defend itself against incoming Russian attacks but is not assisting in offensive strikes on Kremlin forces, according to sources.",
        "url": "https://www.foxnews.com/politics/us-ukraine-intelligence-russia",
        "count": 1
    },
    {
        "title": "Four big things Trump and his team took on this week",
        "description": "The past seven days have seen tariffs implemented, a major domestic speech and developments on relations with Ukraine.",
        "url": "https://www.bbc.com/news/articles/cd7e23g1l3ro",
        "count": 1
    }
]